Revit 2027 API
BuiltInFailures.FaceSplitterFailures.InvalidOpenLoopsForFaceSplit Property
 The open loops used to split the face must lie completely within the face and cannot intersect or overlap any of the face's edges.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidOpenLoopsForFaceSplit { get; }
Public Shared ReadOnly Property InvalidOpenLoopsForFaceSplit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidOpenLoopsForFaceSplit {
	FailureDefinitionId^ get ();
}
static member InvalidOpenLoopsForFaceSplit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FaceSplitterFailures Class
Autodesk.Revit.DB Namespace